Public Member Functions | List of all members
ACAPI::MEP::TransitionDefault::Modifier Class Reference
MEP Element Manager
Modifier of the TransitionDefault. More...
#include <MEPTransitionDefault.hpp>
 Inheritance diagram for ACAPI::MEP::TransitionDefault::Modifier:
 Public Member Functions
Result< void >  | SetAngle (double angle)
Sets the length of TransitionDefault in the case of Duct and Cable Carrier.
Result< void >  | SetPreferenceTable (const UniqueID &tableId)
Sets the PreferenceTable of the TransitionDefault in the case of Duct and Pipe. This PreferenceTable will be transferred into the Transitions when a route is placed or modified.
 Public Member Functions inherited from ACAPI::MEP::ElementDefault::Modifier
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault::Modifier
Modifier (ElementDefault &parent)
Constructs a Modifier with the given parent ElementDefault.
Detailed Description
Modifier of the TransitionDefault.
Member Function Documentation
◆ SetAngle()
 Result< void > ACAPI::MEP::TransitionDefault::Modifier::SetAngle  |  ( |  double |  angle | )
Sets the length of TransitionDefault in the case of Duct and Cable Carrier.
Parameters
angle | The value to be set. Needs to be between [1, 89] degrees.
Returns
Returns an error in case of Pipe Transition or if the parameter is not in range, otherwise nothing.
◆ SetPreferenceTable()
 Result< void > ACAPI::MEP::TransitionDefault::Modifier::SetPreferenceTable  |  ( |  const UniqueID & |  tableId | )
Sets the PreferenceTable of the TransitionDefault in the case of Duct and Pipe. This PreferenceTable will be transferred into the Transitions when a route is placed or modified.
Parameters
tableId | The UniqueID referring to the PreferenceTable to be set.
Returns
Returns an error in the case of Cable Carrier Transition or if the referred TransitionTable can not be found, otherwise nothing.